Repository: kitcarson88/flutter-pokedex-scaffold
Catalog: assets/i18n/app_*.arb
Languages: es

# connectionError
source: A network error occurs. Check device connection and retry
es: Si è verificato un problema di rete. Controllare la connessione del dispositivo e riprovare

# serviceError
source: An error has occurred in the retrieval of {dataName} informations
es: Si è verificato un errore nel recupero delle informazioni {article} {dataName}

# sessionError
source: A session error has occurred. Please log in again
es: Si è verificato un errore di sessione. Si prega di effettuare nuovamente l'accesso

# genericError
source: An error has occured
es: Si è verificato un errore

# pleaseRetryError
source: An error has occured. Please retry
es: Si è verificato un errore. Si prega di riprovare

# noDataFound
source: No {dataName} found
es: {gender, select, male{{no} {dataName} trovato} female{{no} {dataName} trovata} other{{no} {dataName} trovato}}

source: no
es: {gender, select, male{nessuno} female{nessuna} other{nessun}}

source: retry
es: riprova

# youAreOffline
source: you are currently offline
es: al momento sei offline

source: you are online again
es: sei di nuovo online

source: dismiss
es: chiudi

source: favorites
es: preferiti

source: use cases
es: esempi

source: settings
es: impostazioni
